In [1]:
import pandas as pd

In [3]:
data_frame = pd.DataFrame({
    'roll_no' : [102, 101, 104, 103, 105],
    'name' : ['Denis', 'Stella', 'Winfrida', 'Deus', 'Suzana'],
    'grade' : ['A', 'B', 'A', 'C', 'C'],
    'marks' : [25, 19, 22, 10, 13],
    'city' : ['Ubungo', 'Masasi', 'Pwani', 'Temeke', 'Kigamboni']
})

data_frame

   roll_no      name grade  marks       city
0      102     Denis     A     25     Ubungo
1      101    Stella     B     19     Masasi
2      104  Winfrida     A     22      Pwani
3      103      Deus     C     10     Temeke
4      105    Suzana     C     13  Kigamboni

In [4]:
data_frame.sort_values(by=['grade'])

   roll_no      name grade  marks       city
0      102     Denis     A     25     Ubungo
2      104  Winfrida     A     22      Pwani
1      101    Stella     B     19     Masasi
3      103      Deus     C     10     Temeke
4      105    Suzana     C     13  Kigamboni

In [5]:
data_frame.sort_values(by=['roll_no'])

   roll_no      name grade  marks       city
1      101    Stella     B     19     Masasi
0      102     Denis     A     25     Ubungo
3      103      Deus     C     10     Temeke
2      104  Winfrida     A     22      Pwani
4      105    Suzana     C     13  Kigamboni

In [6]:
data_frame.sort_values(by=['grade', 'marks'], ascending=[True, False])

   roll_no      name grade  marks       city
0      102     Denis     A     25     Ubungo
2      104  Winfrida     A     22      Pwani
1      101    Stella     B     19     Masasi
4      105    Suzana     C     13  Kigamboni
3      103      Deus     C     10     Temeke

In [7]:
data_frame

   roll_no      name grade  marks       city
0      102     Denis     A     25     Ubungo
1      101    Stella     B     19     Masasi
2      104  Winfrida     A     22      Pwani
3      103      Deus     C     10     Temeke
4      105    Suzana     C     13  Kigamboni

In [8]:
data_frame.sort_values(by=['grade', 'marks'], ascending=[True, False], inplace=True)

In [9]:
data_frame

   roll_no      name grade  marks       city
0      102     Denis     A     25     Ubungo
2      104  Winfrida     A     22      Pwani
1      101    Stella     B     19     Masasi
4      105    Suzana     C     13  Kigamboni
3      103      Deus     C     10     Temeke

In [10]:
data_frame.reset_index()

   index  roll_no      name grade  marks       city
0      0      102     Denis     A     25     Ubungo
1      2      104  Winfrida     A     22      Pwani
2      1      101    Stella     B     19     Masasi
3      4      105    Suzana     C     13  Kigamboni
4      3      103      Deus     C     10     Temeke

In [12]:
data_frame.reset_index(inplace=True, drop=True)

data_frame

   roll_no      name grade  marks       city
0      102     Denis     A     25     Ubungo
1      104  Winfrida     A     22      Pwani
2      101    Stella     B     19     Masasi
3      105    Suzana     C     13  Kigamboni
4      103      Deus     C     10     Temeke